# AU 编号统一用字符串 'AU01', 'AU02', ...（与你的 mapping 一致）
AU_to_region = {
    'AU01': '眉毛',
    'AU02': '眉毛',
    'AU04': '眉毛',
    'AU05': '眼睛',
    'AU06': '眼睛',
    'AU07': '眼睛',
    'AU09': '鼻子',
    'AU38': '鼻子',
    'AU10': '嘴巴',
    'AU12': '嘴巴',
    'AU14': '嘴巴',
    'AU15': '嘴巴',
    'AU16': '嘴巴',
    'AU18': '嘴巴',
    'AU20': '嘴巴',
    'AU23': '嘴巴',
    'AU24': '嘴巴',
    'AU25': '嘴巴',
    'AU17': '下巴',
    'AU26': '下巴'
}

# 5 个区域的索引（顺序固定！）
region_to_index = {
    '眉毛': 0,
    '眼睛': 1,
    '鼻子': 2,
    '嘴巴': 3,
    '下巴': 4
}